yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/SampleCode/NuEdgeWise/FaceLandmark/main.cpp
/**************************************************************************//**
 * @file     main.cpp
 * @version  V1.00
 * @brief    face landmark network sample. Demonstrate face landmark detect.
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2024 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/

#include "BoardInit.hpp"      /* Board initialisation */
#include "log_macros.h"      /* Logging macros (optional) */

#include "BufAttributes.hpp" /* Buffer attributes to be applied */
#include "FaceLandmarkModel.hpp"       /* Model API */
#include "FaceDetectionModel.hpp"       /* Model API */
#include "FaceLandmarkPostProcessing.hpp"
#include "FaceDetectorPostProcessing.hpp"

#include "imlib.h"          /* Image processing */
#include "framebuffer.h"
#include <cmath>
#include <cstdio>
#include "ModelFileReader.h"
#include "ff.h"

#undef PI /* PI macro conflict with CMSIS/DSP */
#include "NuMicro.h"

//#define __PROFILE__
#define __USE_DISPLAY__
//#define __USE_UVC__
#define NORMALIZE_INPUT_TO_0_1  1   /* 1=normalize pixel/255 before quant; 0=use raw [0,255] */
#define SPEAKING_DEBUG_OVERLAY  0   /* 1=draw mouth_open, motion_energy, thresholds on screen */

#if defined (FACE_LANDMARK_ATTENTION_MODEL)
#define __LOAD_MODEL_FROM_SD__
#endif

#include "Profiler.hpp"

#include "ImageSensor.h"

#if defined (__USE_DISPLAY__)
    #include "Display.h"
#endif

#if defined (__USE_UVC__)
    #include "UVC.h"
#endif

#define NUM_FRAMEBUF 2  //1 or 2
#define MODEL_AT_HYPERRAM_ADDR (0x82400000)
#define FACE_PRESENCE_THRESHOLD  				(0.4)

/* Speaking detection - 4-point mouth_open_norm + motion energy + adaptive thresholds */
#define SPEAKING_SMOOTHING_FRAMES			(3)      /* Consecutive updates above threshold to trigger */
#define SPEAKING_RELEASE_FRAMES				(5)      /* Consecutive below to release */
#define SPEAKING_MIN_DURATION_FRAMES		(6)      /* Min frames speaking before can release */
#define SPEAKING_DETECT_EVERY_N_FRAMES		(2)      /* Run detection every N frames */
#define MAR_SMOOTHING_ALPHA				(0.22f)  /* Heavy smoothing - reduces head-movement jitter */
#define BBOX_SMOOTHING_ALPHA				(0.25f)  /* Face bbox EMA - for storage only, NOT for crop */
#define HEAD_MOVE_THRESHOLD				(0.12f)  /* Only reject when bbox center moved > 12% of size */
#define BBOX_PADDING_PERCENT				(15)     /* Add 15% padding around face crop - keeps lips in frame */
#define OPEN_MIN_THRESHOLD				(0.12f)  /* Min mouth_open_norm to trigger */
#define CLOSE_MIN_THRESHOLD				(0.08f)  /* Below this = mouth closed, can release */
#define ADAPTIVE_K_ON					(5.0f)   /* Motion thresh = noise_mean + K_on * noise_mad */
#define ADAPTIVE_K_OFF					(2.5f)   /* Release thresh */
#define NOISE_EMA_ALPHA					(0.1f)   /* Update noise floor slowly */

/* Landmark smoothing */
#define LANDMARK_SMOOTHING_ALPHA			(0.28f)  /* Lower = more smoothing */

/* Lip offset: landmarks too high = shift down. Tune per camera/model. */
#define LIP_OFFSET_X  (4)   /* Pixels to shift right */
#define LIP_OFFSET_Y  (3)   /* Positive = shift down (corrects "too high") */

/* Lip indices: lip contour for drawing. 4-point mouth: 13,14 (upper/lower lip), 61,291 (corners). */
#define LIP_LANDMARK_NUM		(24)
#define MOUTH_UPPER_LIP		13
#define MOUTH_LOWER_LIP		14
#define MOUTH_LEFT_CORNER	61
#define MOUTH_RIGHT_CORNER	291
#define MOUTH_CHIN			152
#define MOTION_ENERGY_WINDOW	12     /* Ring buffer size for motion energy (~0.5s at 10fps) */
static const int s_i32LipLandmarkIndices[LIP_LANDMARK_NUM] = {
	61, 146, 91, 181, 84, 17, 314, 405, 321, 375, 291, 185, 40, 39, 37, 0, 267, 269, 270, 409,
	78, 308, 87, 14
};

typedef enum
{
    eFRAMEBUF_EMPTY,
    eFRAMEBUF_FULL,
    eFRAMEBUF_INF
} E_FRAMEBUF_STATE;

typedef struct
{
    E_FRAMEBUF_STATE eState;
    image_t frameImage;
    std::vector<arm::app::face_landmark::KeypointResult> results_KP;
    std::vector<arm::app::face_detection::DetectionResult> results_FD;
    std::vector<bool> isSpeaking;   /* Per-face speaking state */
} S_FRAMEBUF;

/* Previous lip positions - stores SMOOTHED RELATIVE coords (0-1 within face bbox) for velocity + EMA */
#define MAX_TRACKED_FACES  5
typedef struct {
    float lipX[LIP_LANDMARK_NUM];
    float lipY[LIP_LANDMARK_NUM];
    float prevMouthOpenNorm;       /* For velocity */
    float prevPrevMouthOpenNorm;
    int prevPrevValid;
    float motionBuf[MOTION_ENERGY_WINDOW];  /* Ring buffer */
    int motionBufIdx;
    int motionBufCnt;
    float noiseMean;               /* Adaptive baseline when NOT speaking */
    float noiseMad;                /* Mean abs dev for thresholds */
    int x0, y0, w, h;
    int smoothX0, smoothY0, smoothW, smoothH;
    int valid;
} S_PREV_LIP_STATE;
static S_PREV_LIP_STATE s_asPrevLipState[MAX_TRACKED_FACES];
static int s_i32SpeakingConfirmCount[MAX_TRACKED_FACES];
static int s_i32SpeakingReleaseCount[MAX_TRACKED_FACES];
static int s_i32SpeakingDurationCount[MAX_TRACKED_FACES];
static bool s_abSpeaking[MAX_TRACKED_FACES];  /* Per-track speaking state (trackId-indexed) */

static float s_afSmoothedRelX[LIP_LANDMARK_NUM];  /* Relative coords 0-1 within face bbox */
static float s_afSmoothedRelY[LIP_LANDMARK_NUM];
static uint32_t s_u32SpeakingDetectFrameCount = 0;  /* Skip frames: only run detection every N frames */

S_FRAMEBUF s_asFramebuf[NUM_FRAMEBUF];

namespace arm
{
namespace app
{
/* Tensor arena buffer */
#undef ACTIVATION_BUF_SZ
#if defined(FACE_LANDMARK_ATTENTION_MODEL)
#define FACE_LANDMARK_ACTIVATION_BUF_SZ	 (500000)
#else
#define FACE_LANDMARK_ACTIVATION_BUF_SZ	 (460000)
#endif
#define FACE_DETECTION_ACTIVATION_BUF_SZ (460000)
static uint8_t tensorArena_FaceLandmark[FACE_LANDMARK_ACTIVATION_BUF_SZ] ACTIVATION_BUF_ATTRIBUTE;
static uint8_t tensorArena_FaceDetection[FACE_DETECTION_ACTIVATION_BUF_SZ] ACTIVATION_BUF_ATTRIBUTE;

#if !defined(__LOAD_MODEL_FROM_SD__)
/* Optional getter function for the model pointer and its size. */
namespace face_landmark
{
extern uint8_t *GetModelPointer();
extern size_t GetModelLen();
} /* namespace face_landmark */

namespace face_detection
{
extern uint8_t *GetModelPointer();
extern size_t GetModelLen();
} /* namespace face_detection */

#endif

} /* namespace app */
} /* namespace arm */

//frame buffer managemnet function
static S_FRAMEBUF *get_empty_framebuf()
{
    int i;

    for (i = 0; i < NUM_FRAMEBUF; i ++)
    {
        if (s_asFramebuf[i].eState == eFRAMEBUF_EMPTY)
            return &s_asFramebuf[i];
    }

