yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/SampleCode/NuEdgeWise/FaceLandmark/main.cpp
    return NULL;
}

static S_FRAMEBUF *get_full_framebuf()
{
    int i;

    for (i = 0; i < NUM_FRAMEBUF; i ++)
    {
        if (s_asFramebuf[i].eState == eFRAMEBUF_FULL)
            return &s_asFramebuf[i];
    }

    return NULL;
}

static S_FRAMEBUF *get_inf_framebuf()
{
    int i;

    for (i = 0; i < NUM_FRAMEBUF; i ++)
    {
        if (s_asFramebuf[i].eState == eFRAMEBUF_INF)
            return &s_asFramebuf[i];
    }

    return NULL;
}

#define IMAGE_DISP_UPSCALE_FACTOR 1
#if defined(LT7381_LCD_PANEL)
#define FONT_DISP_UPSCALE_FACTOR 2
#else
#define FONT_DISP_UPSCALE_FACTOR 1
#endif

/* Image processing initiate function */
//Used by omv library
#if defined(__USE_UVC__)
//UVC only support QVGA, QQVGA
#define GLCD_WIDTH	320
#define GLCD_HEIGHT	240
#else
#define GLCD_WIDTH	240
#define GLCD_HEIGHT	240
#endif

#define IMAGE_FB_SIZE	(GLCD_WIDTH * GLCD_HEIGHT * 2)

/* Quantize uint8 pixel to int8 using tensor scale/zero_point. Fixes landmark tracking if model expects specific input range. */
static inline int8_t QuantizePixel(uint8_t pixel, float scale, int zeroPoint, int normalize01)
{
	float f;
	if (normalize01) {
		f = (float)pixel / 255.0f;
	} else {
		f = (float)pixel;
	}
	if (scale < 1e-6f) scale = 1.0f / 255.0f;  /* Fallback if scale missing */
	float q = f / scale + (float)zeroPoint;
	int qi = (int)(q >= 0 ? q + 0.5f : q - 0.5f);
	if (qi < -128) qi = -128;
	if (qi > 127) qi = 127;
	return (int8_t)qi;
}

#undef OMV_FB_SIZE
#define OMV_FB_SIZE (IMAGE_FB_SIZE + 1024)

#undef OMV_FB_ALLOC_SIZE
#define OMV_FB_ALLOC_SIZE	(1*1024)

__attribute__((section(".bss.vram.data"), aligned(32))) static char fb_array[OMV_FB_SIZE + OMV_FB_ALLOC_SIZE];
__attribute__((section(".bss.vram.data"), aligned(32))) static char jpeg_array[OMV_JPEG_BUF_SIZE];

#if (NUM_FRAMEBUF == 2)
    __attribute__((section(".bss.vram.data"), aligned(32))) static char frame_buf1[OMV_FB_SIZE];
#endif

char *_fb_base = NULL;
char *_fb_end = NULL;
char *_jpeg_buf = NULL;
char *_fballoc = NULL;

static void omv_init()
{
    image_t frameBuffer;
    int i;

    frameBuffer.w = GLCD_WIDTH;
    frameBuffer.h = GLCD_HEIGHT;
    frameBuffer.size = GLCD_WIDTH * GLCD_HEIGHT * 2;
    frameBuffer.pixfmt = PIXFORMAT_RGB565;

    _fb_base = fb_array;
    _fb_end =  fb_array + OMV_FB_SIZE - 1;
    _fballoc = _fb_base + OMV_FB_SIZE + OMV_FB_ALLOC_SIZE;
    _jpeg_buf = jpeg_array;

    fb_alloc_init0();

    framebuffer_init0();
    framebuffer_init_from_image(&frameBuffer);

    for (i = 0 ; i < NUM_FRAMEBUF; i++)
    {
        s_asFramebuf[i].eState = eFRAMEBUF_EMPTY;
    }

    framebuffer_init_image(&s_asFramebuf[0].frameImage);

#if (NUM_FRAMEBUF == 2)
    s_asFramebuf[1].frameImage.w = GLCD_WIDTH;
    s_asFramebuf[1].frameImage.h = GLCD_HEIGHT;
    s_asFramebuf[1].frameImage.size = GLCD_WIDTH * GLCD_HEIGHT * 2;
    s_asFramebuf[1].frameImage.pixfmt = PIXFORMAT_RGB565;
    s_asFramebuf[1].frameImage.data = (uint8_t *)frame_buf1;
#endif
}

/* Draw lip keypoints: convert relative (0-1) to absolute using face bbox. */
static void DrawLipLandmark(
    const float *smoothedRelX, const float *smoothedRelY,
    int faceX0, int faceY0, int faceW, int faceH,
    image_t *drawImg
)
{
	int lipColor = COLOR_R5_G6_B5_TO_RGB565(0, COLOR_G6_MAX, 0);
	for (int i = 0; i < LIP_LANDMARK_NUM; i++) {
		int drawX = faceX0 + (int)(smoothedRelX[i] * faceW) + LIP_OFFSET_X;
		int drawY = faceY0 + (int)(smoothedRelY[i] * faceH) + LIP_OFFSET_Y;
		imlib_draw_circle(drawImg, drawX, drawY, 2, lipColor, 1, true);
	}
}

/* Apply EMA in RELATIVE space (0-1 within face bbox). Head movement doesn't affect relative lip position. */
static void ApplyLipSmoothing(
    const std::vector<arm::app::face_landmark::KeypointResult> &results_KP,
    int prevFaceIdx, int faceW, int faceH,
    float *outSmoothedRelX, float *outSmoothedRelY
)
{
    for (int i = 0; i < LIP_LANDMARK_NUM; i++) {
        int idx = s_i32LipLandmarkIndices[i];
        if (idx >= (int)results_KP.size()) continue;
        /* Landmark m_x,m_y are in face crop coords (0 to faceW, 0 to faceH). Normalize to 0-1. */
        float rawRelX = (faceW > 0) ? ((float)results_KP[idx].m_x / (float)faceW) : 0.0f;
        float rawRelY = (faceH > 0) ? ((float)results_KP[idx].m_y / (float)faceH) : 0.0f;
        if (prevFaceIdx >= 0 && prevFaceIdx < MAX_TRACKED_FACES && s_asPrevLipState[prevFaceIdx].valid) {
            outSmoothedRelX[i] = LANDMARK_SMOOTHING_ALPHA * rawRelX + (1.0f - LANDMARK_SMOOTHING_ALPHA) * s_asPrevLipState[prevFaceIdx].lipX[i];
            outSmoothedRelY[i] = LANDMARK_SMOOTHING_ALPHA * rawRelY + (1.0f - LANDMARK_SMOOTHING_ALPHA) * s_asPrevLipState[prevFaceIdx].lipY[i];
        } else {
            outSmoothedRelX[i] = rawRelX;
            outSmoothedRelY[i] = rawRelY;
        }
    }
}

/* 4-point mouth openness: upper lip 13, lower 14, corners 61,291. Scale-invariant. */
static float ComputeMouthOpenNorm(
    const std::vector<arm::app::face_landmark::KeypointResult> &results_KP,
    int faceW, int faceH
)
{
    if (results_KP.size() < 468 || faceW <= 0 || faceH <= 0) return 0.0f;
    float uX = (float)results_KP[MOUTH_UPPER_LIP].m_x / (float)faceW;
    float uY = (float)results_KP[MOUTH_UPPER_LIP].m_y / (float)faceH;
    float lX = (float)results_KP[MOUTH_LOWER_LIP].m_x / (float)faceW;
    float lY = (float)results_KP[MOUTH_LOWER_LIP].m_y / (float)faceH;
    float cLX = (float)results_KP[MOUTH_LEFT_CORNER].m_x / (float)faceW;
    float cLY = (float)results_KP[MOUTH_LEFT_CORNER].m_y / (float)faceH;
    float cRX = (float)results_KP[MOUTH_RIGHT_CORNER].m_x / (float)faceW;
    float cRY = (float)results_KP[MOUTH_RIGHT_CORNER].m_y / (float)faceH;
    float mouthOpen = std::sqrt((lX-uX)*(lX-uX) + (lY-uY)*(lY-uY));
    float mouthWidth = std::sqrt((cRX-cLX)*(cRX-cLX) + (cRY-cLY)*(cRY-cLY));
    if (mouthWidth < 0.01f) return 0.0f;
    return mouthOpen / mouthWidth;
}

/* Velocity, motion energy, and adaptive thresholds. Returns motion_energy and smoothed mouth_open_norm. */
static float ComputeMotionEnergyAndUpdate(
    float mouthOpenNorm, int trackId,
    float *outSmoothedOpen, float *outMotionEnergy, float *outNoiseMean, float *outNoiseMad
)
{
    float smoothed = mouthOpenNorm;
    float velocity = 0.0f;
    float motionEnergy = 0.0f;
    *outNoiseMean = 0.01f;
    *outNoiseMad = 0.005f;
    if (trackId < 0 || trackId >= MAX_TRACKED_FACES) {
        *outSmoothedOpen = smoothed;
        *outMotionEnergy = 0.0f;
        return velocity;
    }
    S_PREV_LIP_STATE *s = &s_asPrevLipState[trackId];
    if (s->valid) {
        smoothed = MAR_SMOOTHING_ALPHA * mouthOpenNorm + (1.0f - MAR_SMOOTHING_ALPHA) * s->prevMouthOpenNorm;
        velocity = (smoothed > s->prevMouthOpenNorm) ? (smoothed - s->prevMouthOpenNorm) : (s->prevMouthOpenNorm - smoothed);
        if (s->prevPrevValid)
            velocity = (smoothed > s->prevPrevMouthOpenNorm) ? (smoothed - s->prevPrevMouthOpenNorm) : (s->prevPrevMouthOpenNorm - smoothed);
    }
    /* Push velocity to ring buffer */
    if (trackId >= 0 && trackId < MAX_TRACKED_FACES) {
        s->motionBuf[s->motionBufIdx] = velocity;
        s->motionBufIdx = (s->motionBufIdx + 1) % MOTION_ENERGY_WINDOW;
        if (s->motionBufCnt < MOTION_ENERGY_WINDOW) s->motionBufCnt++;
        float sum = 0.0f;
        for (int i = 0; i < s->motionBufCnt; i++) sum += s->motionBuf[i];
        motionEnergy = sum / (float)s->motionBufCnt;
        *outMotionEnergy = motionEnergy;
        *outNoiseMean = s->noiseMean;
        *outNoiseMad = s->noiseMad;
        if (!s_abSpeaking[trackId] && s->motionBufCnt >= 4) {
            s->noiseMean = NOISE_EMA_ALPHA * motionEnergy + (1.0f - NOISE_EMA_ALPHA) * s->noiseMean;
            float mad = 0.0f;
            for (int i = 0; i < s->motionBufCnt; i++)
                mad += (s->motionBuf[i] > s->noiseMean) ? (s->motionBuf[i] - s->noiseMean) : (s->noiseMean - s->motionBuf[i]);
            mad /= (float)s->motionBufCnt;
            s->noiseMad = NOISE_EMA_ALPHA * mad + (1.0f - NOISE_EMA_ALPHA) * s->noiseMad;
            if (s->noiseMad < 0.001f) s->noiseMad = 0.005f;
        }
    }
    *outSmoothedOpen = smoothed;
    return velocity;
}

/* Find best-matching previous face by bbox center distance (for face order changes) */
static int FindMatchingPrevFace(int curX0, int curY0, int curW, int curH)
{
    int bestIdx = -1;
    float bestDist = 1e9f;
    int curCx = curX0 + curW / 2;
    int curCy = curY0 + curH / 2;

    for (int j = 0; j < MAX_TRACKED_FACES; j++) {
        if (!s_asPrevLipState[j].valid) continue;
        int prevCx = s_asPrevLipState[j].x0 + s_asPrevLipState[j].w / 2;
        int prevCy = s_asPrevLipState[j].y0 + s_asPrevLipState[j].h / 2;
        float dx = (float)(curCx - prevCx);
        float dy = (float)(curCy - prevCy);
        float dist = std::sqrt(dx*dx + dy*dy);
        if (dist < bestDist && dist < (float)(curW + curH)) {  /* Allow face to move within ~2x face size */
            bestDist = dist;
            bestIdx = j;
        }
    }
    return bestIdx;
}

