yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/SampleCode/NuEdgeWise/FaceLandmark/main.cpp
		if(newY < 0)
			newY = 0;

		if(newX + newW >= infFramebuf->frameImage.w)
			newW = infFramebuf->frameImage.w - newX;
		
		if(newY + newH >= infFramebuf->frameImage.h)
			newH = infFramebuf->frameImage.h - newY;

		faceBox->m_x0 = newX;
		faceBox->m_y0 = newY;
		faceBox->m_w = newW;
		faceBox->m_h = newH;
	}
}

static void DetectFaceLandmark_DrawResult(
    S_FRAMEBUF *infFramebuf,
    arm::app::FaceLandmarkModel *faceLandmarkModel,	
	arm::app::face_landmark::FaceLandmarkPostProcessing *postProcess,
	arm::app::Profiler *profiler
)
{
	int i;
	arm::app::face_detection::DetectionResult faceBox;
    rectangle_t roi;
    TfLiteIntArray *inputShape = faceLandmarkModel->GetInputShape(0);
    TfLiteTensor *inputTensor   = faceLandmarkModel->GetInputTensor(0);

    const int inputImgCols = inputShape->data[arm::app::FaceLandmarkModel::ms_inputColsIdx];
    const int inputImgRows = inputShape->data[arm::app::FaceLandmarkModel::ms_inputRowsIdx];

	uint64_t u64StartCycle;
	uint64_t u64EndCycle;

	//Quantize input tensor data
	auto *req_data = static_cast<uint8_t *>(inputTensor->data.data);
	auto *signed_req_data = static_cast<int8_t *>(inputTensor->data.data);

    arm::app::QuantParams inQuantParams = arm::app::GetTensorQuantParams(inputTensor);

	TfLiteTensor *modelOutput0 = faceLandmarkModel->GetOutputTensor(FACE_LANDMARK_MESH_TENSOR_INDEX);

	#if defined(FACE_LANDMARK_LEFT_IRIS_TENSOR_INDEX)
		TfLiteTensor *modelOutput1 = faceLandmarkModel->GetOutputTensor(FACE_LANDMARK_LEFT_IRIS_TENSOR_INDEX);
	#else
		TfLiteTensor *modelOutput1 = NULL;
	#endif

	#if defined(FACE_LANDMARK_RIGHT_IRIS_TENSOR_INDEX)
		TfLiteTensor *modelOutput2 = faceLandmarkModel->GetOutputTensor(FACE_LANDMARK_RIGHT_IRIS_TENSOR_INDEX);			
	#else
		TfLiteTensor *modelOutput2 = NULL;
	#endif

	TfLiteTensor *modelOutput3 = faceLandmarkModel->GetOutputTensor(FACE_LANDMARK_FACE_FLAG_TENSOR_INDEX);

	/* Resize speaking state to match face count */
	infFramebuf->isSpeaking.resize(infFramebuf->results_FD.size(), false);

	/* Frame skip: only run speaking detection every N frames - reduces jitter-induced false triggers */
	s_u32SpeakingDetectFrameCount++;
	const int runDetectionThisFrame = (s_u32SpeakingDetectFrameCount % SPEAKING_DETECT_EVERY_N_FRAMES) == 0;
	
	for(i = 0 ; i < infFramebuf->results_FD.size(); i ++)
	{
		faceBox = infFramebuf->results_FD[i];

		/* Stable trackId: use for all state. Fixes flicker when face order changes. */
		int matchedPrev = FindMatchingPrevFace(faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h);
		if (matchedPrev < 0 && infFramebuf->results_FD.size() == 1) {
			matchedPrev = (s_asPrevLipState[0].valid) ? 0 : -1;
		}
		int trackId = (matchedPrev >= 0) ? matchedPrev : AllocateTrack(i);
		if (matchedPrev < 0 && trackId < MAX_TRACKED_FACES) {
			s_abSpeaking[trackId] = false;
			s_i32SpeakingConfirmCount[trackId] = 0;
			s_i32SpeakingReleaseCount[trackId] = 0;
			s_i32SpeakingDurationCount[trackId] = 0;
			s_asPrevLipState[trackId].motionBufIdx = 0;
			s_asPrevLipState[trackId].motionBufCnt = 0;
			s_asPrevLipState[trackId].noiseMean = 0.01f;
			s_asPrevLipState[trackId].noiseMad = 0.005f;
		}

		/* Raw bbox + padding - keeps lips in frame with small bbox jitter. */
		{
			int padX = (faceBox.m_w * BBOX_PADDING_PERCENT) / 100;
			int padY = (faceBox.m_h * BBOX_PADDING_PERCENT) / 100;
			int imgW = infFramebuf->frameImage.w;
			int imgH = infFramebuf->frameImage.h;
			roi.x = faceBox.m_x0 - padX;
			roi.y = faceBox.m_y0 - padY;
			roi.w = faceBox.m_w + 2 * padX;
			roi.h = faceBox.m_h + 2 * padY;
			if (roi.x < 0) { roi.w += roi.x; roi.x = 0; }
			if (roi.y < 0) { roi.h += roi.y; roi.y = 0; }
			if (roi.x + roi.w > imgW) roi.w = imgW - roi.x;
			if (roi.y + roi.h > imgH) roi.h = imgH - roi.y;
			if (roi.w < 8) roi.w = faceBox.m_w;
			if (roi.h < 8) roi.h = faceBox.m_h;
		}

		//resize face region image to input tensor
		image_t resizeImg;

		resizeImg.w = inputImgCols;
		resizeImg.h = inputImgRows;
		resizeImg.data = (uint8_t *)inputTensor->data.data; //direct resize to input tensor buffer
		resizeImg.pixfmt = PIXFORMAT_RGB888;

		if(profiler)
			u64StartCycle = pmu_get_systick_Count();

        imlib_nvt_scale(&infFramebuf->frameImage, &resizeImg, &roi);

		if(profiler){
			u64EndCycle = pmu_get_systick_Count();
			info("face landmark resize cycles %llu \n", (u64EndCycle - u64StartCycle));
		}
			
		if(profiler){
			u64StartCycle = pmu_get_systick_Count();
		}
			
		/* Quantize using tensor scale/zero_point. Wrong quant = poor landmarks. */
		for (size_t i = 0; i < inputTensor->bytes; i++)
		{
			signed_req_data[i] = QuantizePixel(req_data[i], inQuantParams.scale, inQuantParams.offset, NORMALIZE_INPUT_TO_0_1);
		}

		if(profiler){
			u64EndCycle = pmu_get_systick_Count();
			info("face landmark quantize cycles %llu \n", (u64EndCycle - u64StartCycle));
		}

		if(profiler){
			profiler->StartProfiling("Inference");
		}

		faceLandmarkModel->RunInference();

		if(profiler){
			profiler->StopProfiling();
			profiler->PrintProfilingResult();
		}

		if(profiler){
			u64StartCycle = pmu_get_systick_Count();
		}

		postProcess->RunPostProcessing(
			inputImgCols,
			inputImgRows,
			roi.w,
			roi.h,
			modelOutput0,
			modelOutput1,
			modelOutput2,
			modelOutput3,
			infFramebuf->results_KP);

		if(profiler){
			u64EndCycle = pmu_get_systick_Count();
			info("face landmark post processing cycles %llu \n", (u64EndCycle - u64StartCycle));
		}

		/* Always: smoothing + drawing. Detection + store only every N frames. */
		if (trackId < MAX_TRACKED_FACES && infFramebuf->results_KP.size() >= 468) {
			ApplyLipSmoothing(infFramebuf->results_KP, trackId, roi.w, roi.h, s_afSmoothedRelX, s_afSmoothedRelY);

			if (runDetectionThisFrame) {
				/* 4-point mouth_open_norm + motion energy + adaptive thresholds */
				float rawMouthOpen = ComputeMouthOpenNorm(infFramebuf->results_KP, roi.w, roi.h);
				float smoothedOpen, motionEnergy, noiseMean, noiseMad;
				ComputeMotionEnergyAndUpdate(rawMouthOpen, trackId, &smoothedOpen, &motionEnergy, &noiseMean, &noiseMad);

				float onThresh = noiseMean + ADAPTIVE_K_ON * noiseMad;
				float offThresh = noiseMean + ADAPTIVE_K_OFF * noiseMad;

				float headMove = HeadMoveAmount(trackId, faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h);
				int headMoving = (headMove > HEAD_MOVE_THRESHOLD);

				int signalAboveOn  = !headMoving && (motionEnergy > onThresh) && (smoothedOpen > OPEN_MIN_THRESHOLD);
				int signalBelowOff = (motionEnergy < offThresh) || (smoothedOpen < CLOSE_MIN_THRESHOLD);

				/* All state indexed by trackId - fixes flicker when face order changes */
				if (signalAboveOn) {
					s_i32SpeakingConfirmCount[trackId] = (s_i32SpeakingConfirmCount[trackId] < SPEAKING_SMOOTHING_FRAMES) ? s_i32SpeakingConfirmCount[trackId] + 1 : SPEAKING_SMOOTHING_FRAMES;
					s_i32SpeakingReleaseCount[trackId] = 0;
					if (s_i32SpeakingConfirmCount[trackId] >= SPEAKING_SMOOTHING_FRAMES) {
						s_abSpeaking[trackId] = true;
					}
				} else if (s_abSpeaking[trackId]) {
					s_i32SpeakingDurationCount[trackId]++;
					if (signalBelowOff) {
						s_i32SpeakingReleaseCount[trackId]++;
						if (s_i32SpeakingReleaseCount[trackId] >= SPEAKING_RELEASE_FRAMES &&
							s_i32SpeakingDurationCount[trackId] >= SPEAKING_MIN_DURATION_FRAMES) {
							s_abSpeaking[trackId] = false;
						}
					} else {
						s_i32SpeakingReleaseCount[trackId] = 0;
					}
					s_i32SpeakingConfirmCount[trackId] = 0;
				} else {
					s_i32SpeakingReleaseCount[trackId] = 0;
					s_i32SpeakingConfirmCount[trackId] = 0;
					s_i32SpeakingDurationCount[trackId] = 0;
				}
				if (!s_abSpeaking[trackId]) {
					s_i32SpeakingDurationCount[trackId] = 0;
				}
				/* Map trackId -> face index for display */
				infFramebuf->isSpeaking[i] = s_abSpeaking[trackId];
				StoreLipState(s_afSmoothedRelX, s_afSmoothedRelY, smoothedOpen, trackId, faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h);
#if SPEAKING_DEBUG_OVERLAY
				{
					char dbg[96];
					int textY = faceBox.m_y0 + faceBox.m_h + 2;
					snprintf(dbg, sizeof(dbg), "op%.2f me%.3f nm%.3f md%.3f", smoothedOpen, motionEnergy, noiseMean, noiseMad);
					imlib_draw_string(&infFramebuf->frameImage, faceBox.m_x0, textY, dbg, C_WHITE, 1, 0, 0, false, 0, false, false, 0, false, false);
					snprintf(dbg, sizeof(dbg), "on%.3f off%.3f hm%.2f spk%d cf%d", onThresh, offThresh, headMove, s_abSpeaking[trackId] ? 1 : 0, s_i32SpeakingConfirmCount[trackId]);
					imlib_draw_string(&infFramebuf->frameImage, faceBox.m_x0, textY + 12, dbg, C_WHITE, 1, 0, 0, false, 0, false, false, 0, false, false);
				}
#endif
			} else {
				/* Not a detection frame - still need to map trackId to face for display */
				infFramebuf->isSpeaking[i] = s_abSpeaking[trackId];
			}
		} else if (trackId < MAX_TRACKED_FACES) {
			s_asPrevLipState[trackId].valid = 0;
		}

		//Draw lip landmarks (relative to roi crop - use roi for correct position)
		if(infFramebuf->results_KP.size() >= 468)
		{
			if(profiler){
				u64StartCycle = pmu_get_systick_Count();
			}
			DrawLipLandmark(s_afSmoothedRelX, s_afSmoothedRelY, roi.x, roi.y, roi.w, roi.h, &infFramebuf->frameImage);

			if(profiler){
				u64EndCycle = pmu_get_systick_Count();
				info("draw face landmark cycles %llu \n", (u64EndCycle - u64StartCycle));
			}
		}
	}

	if(profiler){
		u64StartCycle = pmu_get_systick_Count();
	}

	DrawDetectFace(infFramebuf->results_FD, infFramebuf->isSpeaking, &infFramebuf->frameImage);

	if(profiler){
		u64EndCycle = pmu_get_systick_Count();
		info("draw face region cycles %llu \n", (u64EndCycle - u64StartCycle));
	}
}

static int32_t PrepareModelToHyperRAM(void)
{
#define MODEL_FILE "0:\\face_landmark.tflite"
#define EACH_READ_SIZE 512
	
    TCHAR sd_path[] = { '0', ':', 0 };    /* SD drive started from 0 */	
    f_chdrive(sd_path);          /* set default path */

	int32_t i32FileSize;
	int32_t i32FileReadIndex = 0;
	int32_t i32Read;
	
	if(!ModelFileReader_Initialize(MODEL_FILE))
	{
        printf_err("Unable open model %s\n", MODEL_FILE);		
		return -1;
	}
	
	i32FileSize = ModelFileReader_FileSize();
    info("Model file size %i \n", i32FileSize);

	while(i32FileReadIndex < i32FileSize)
	{
		i32Read = ModelFileReader_ReadData((BYTE *)(MODEL_AT_HYPERRAM_ADDR + i32FileReadIndex), EACH_READ_SIZE);
		if(i32Read < 0)
			break;
		i32FileReadIndex += i32Read;
	}
	
